package 변수및자료형;

public class Ex03변수명 {

	public static void main(String[] args) {

		//변수명 사용 규칙!
		//1. 키워드는 사용불가
		//-->>eclipse 작성시 색깔이 변한다면 키워드
		//2. 대소문자를 구분하고 길이에는 제한이 없다.
		//-->> 변수명은 의미전달이 중요하다. a,b,c,d 짓지 말기!
		//3. 숫자로 시작할 수 없다.
		//-->> 1a,3b, 숫자를 값으로 인식
		//4. 특수문자 사용은 가능하나 _,$만 사용이 가능하다.
		
		//무조건 지켜야 하는 규칙은 아니지만 java 개발자 권장 규칙
		//1. 변수를 시작은 소문자로!
		//2. 변수 이름을 작성시 여러글자로 이어지는 경우 이어지는 첫 글자는 대문자로
		//-->> 카멜식 기법 ex) int inputNumer = 4;
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
	}

}
